
brew "fzf"
brew "mise"
brew "neovim"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "ripgrep"
brew "tmux"
brew "watchman" # required by Sorbet LSP to detect file changes
brew "zellij"

cask "antigravity"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "monitorcontrol"
cask "notunes"
cask "obsidian"
cask "raycast"
cask "vlc"
