
brew "delta"
brew "fzf"
brew "gh"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "watchman" # required by Sorbet LSP to detect file changes
brew "zellij"

cask "cursor"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "lm-studio"
cask "monitorcontrol"
cask "notunes"
cask "obsidian"
cask "raycast"
